src/Documents/ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИТ_ПланПродаж_День</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_СтатусыПлановПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинейныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_УстановкаПланаПродаж_СтаршийМенеджер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиНаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_13</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_14</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_15</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_16</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_17</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_19</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_20</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_21</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_22</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_23</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_24</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_25</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_26</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_27</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_28</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_29</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_30</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДень_31</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ит_ТорговыеТочки_Ответственные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ит_ТорговыеТочки_Ответственные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнженерТехПоддержки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительНаправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИТ_КоэффициентыРаспределенияПланаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИТ_КоэффициентыРаспределенияПланаПродаж</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НедельныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>12</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МесячныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>12</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>12</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьТорговыеТочки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка КАК ТорговаяТочка
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПланПродаж КАК ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_ТорговыеТочки_Ответственные.СрезПоследних(, ) КАК ит_ТорговыеТочки_ОтветственныеСрезПоследних
		|		ПО ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка = ит_ТорговыеТочки_ОтветственныеСрезПоследних.ТорговаяТочка		
		|ГДЕ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка = &ДокументОснование
		|	И ит_ТорговыеТочки_ОтветственныеСрезПоследних.Менеджер = &ЛинейныйМенеджер
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка.Наименование";
	
	Запрос.УстановитьПараметр("ДокументОснование",	ДокументОснование);
	Запрос.УстановитьПараметр("ЛинейныйМенеджер",	ЛинейныйМенеджер);
	
	РезультатЗапроса	= Запрос.Выполнить();
	ТорговыеТочки		= РезультатЗапроса.Выгрузить();
	
	ПланПродаж.Загрузить(ТорговыеТочки);
	
КонецПроцедуры

Процедура ЗаполнитьСуммыПланаПродаж(ТорговыеТочки = Неопределено) Экспорт
	
	ТорговыеТочки = ПолучитьТорговыеТочки(ТорговыеТочки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка,
		|	СУММА(ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_1 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_2 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_3 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_4 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_5 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_6 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_7 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_8 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_9 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_10 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_11 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_12 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_13 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_14 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_15 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_16 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_17 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_18 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_19 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_20 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_21 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_22 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_23 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_24 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_25 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_26 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_27 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_28 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_29 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_30 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_31) КАК СуммаПлан
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПланПродаж КАК ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж
		|ГДЕ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка = &ДокументОснование
		|	И ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка В(&ТорговыеТочки)
		|	И ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ДокументРаспределения = &ЭтотДокумент
		|
		|СГРУППИРОВАТЬ ПО
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.ТорговаяТочка";		
	
	Запрос.УстановитьПараметр("ДокументОснование",	ДокументОснование);
	Запрос.УстановитьПараметр("ТорговыеТочки",		ТорговыеТочки);
	Запрос.УстановитьПараметр("ЭтотДокумент",		Ссылка);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		СтрокаПланаПродаж = ПланПродаж.Найти(Выборка.ТорговаяТочка, "ТорговаяТочка");
		
		Если СтрокаПланаПродаж <> Неопределено Тогда 
			СтрокаПланаПродаж.СуммаПлан = ИТ_СпециальныйМодульСервер.ОкруглитьЦену(Выборка.СуммаПлан, 100, Ложь);	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

Процедура РаспределитьСуммыПланаПродаж(ТорговыеТочки = Неопределено, СуммаКРаспределению = 0) Экспорт 
	
	НачалоПериода	= НачалоМесяца(ПериодПлана);
	КонецПериода	= КонецМесяца(ПериодПлана);
	ТорговыеТочки	= ПолучитьТорговыеТочки(ТорговыеТочки);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_КоэффициентыРаспределенияПланаПродаж.ТорговаяТочка КАК ТорговаяТочка,
		|	ИТ_КоэффициентыРаспределенияПланаПродаж.Период КАК Период,
		|	ДЕНЬГОДА(ИТ_КоэффициентыРаспределенияПланаПродаж.Период) КАК ДеньГода,
		|	ИТ_КоэффициентыРаспределенияПланаПродаж.МесячныйКоэффициент КАК Коэффициент
		|ПОМЕСТИТЬ КоэфициентыПоДнямГода
		|ИЗ
		|	РегистрСведений.ИТ_КоэффициентыРаспределенияПланаПродаж КАК ИТ_КоэффициентыРаспределенияПланаПродаж
		|ГДЕ
		|	ИТ_КоэффициентыРаспределенияПланаПродаж.ТорговаяТочка В(&ТорговыеТочки)
		|	И ИТ_КоэффициентыРаспределенияПланаПродаж.Период >= &НачалоПериода
		|	И ИТ_КоэффициентыРаспределенияПланаПродаж.Период <= &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоэфициентыПоДнямГода.ТорговаяТочка КАК ТорговаяТочка,
		|	МИНИМУМ(КоэфициентыПоДнямГода.ДеньГода) КАК ДеньГода
		|ПОМЕСТИТЬ МинимальныеДниГода
		|ИЗ
		|	КоэфициентыПоДнямГода КАК КоэфициентыПоДнямГода
		|
		|СГРУППИРОВАТЬ ПО
		|	КоэфициентыПоДнямГода.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоэфициентыПоДнямГода.ТорговаяТочка КАК ТорговаяТочка,
		|	КоэфициентыПоДнямГода.Период КАК Период,
		|	КоэфициентыПоДнямГода.Коэффициент КАК Коэффициент,
		|	КоэфициентыПоДнямГода.ДеньГода - МинимальныеДниГода.ДеньГода + 1 КАК ДеньМесяца
		|ПОМЕСТИТЬ РаспределенныеСуммы
		|ИЗ
		|	КоэфициентыПоДнямГода КАК КоэфициентыПоДнямГода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеДниГода КАК МинимальныеДниГода
		|		ПО КоэфициентыПоДнямГода.ТорговаяТочка = МинимальныеДниГода.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаспределенныеСуммы.ТорговаяТочка,
		|	РаспределенныеСуммы.Период,
		|	РаспределенныеСуммы.Коэффициент,
		|	РаспределенныеСуммы.ДеньМесяца
		|ИЗ
		|	РаспределенныеСуммы КАК РаспределенныеСуммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаспределенныеСуммы.ТорговаяТочка КАК ТорговаяТочка
		|ИЗ
		|	РаспределенныеСуммы КАК РаспределенныеСуммы";
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Запрос.УстановитьПараметр("ТорговыеТочки",	ТорговыеТочки);
	
	РезультатЗапроса			= Запрос.ВыполнитьПакет();
	ТаблицаСуммРаспределения	= РезультатЗапроса.Получить(3).Выгрузить();
	ТаблицаТорговыеТочки		= РезультатЗапроса.Получить(4).Выгрузить();
	
	Для Каждого СтрокаТорговойТочки Из ТаблицаТорговыеТочки Цикл 
		ТорговаяТочка			= СтрокаТорговойТочки.ТорговаяТочка;
		СтрокаПланаПродаж		= ПланПродаж.Найти(ТорговаяТочка, "ТорговаяТочка");
		СтрокиСуммРаспределения	= ТаблицаСуммРаспределения.НайтиСтроки(Новый Структура("ТорговаяТочка", ТорговаяТочка));
		
		Для Каждого СтрокаСуммыРаспределения Из СтрокиСуммРаспределения Цикл 
			КлючРеквизитаСуммы	= "СуммаДень_" + Формат(СтрокаСуммыРаспределения.ДеньМесяца, "ЧДЦ=0; ЧН=0; ЧГ=0");
			
			Если СуммаКРаспределению = 0 Тогда 
				РасчетнаяСумма = СтрокаПланаПродаж.СуммаПлан * СтрокаСуммыРаспределения.Коэффициент;
			Иначе
				РасчетнаяСумма = СуммаКРаспределению * СтрокаСуммыРаспределения.Коэффициент;	
			КонецЕсли;
			
			ОкругленнаяСумма	= ИТ_СпециальныйМодульСервер.ОкруглитьЦену(РасчетнаяСумма, 100, Ложь);
			СтрокаПланаПродаж[КлючРеквизитаСуммы] = ОкругленнаяСумма;
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#Область ТиповыеПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ИТ_ПланыПродаж.ОбработатьУдалениеДокумента(ЭтотОбъект);
	
	//Если ПометкаУдаления Тогда 
	//	ПометкаУдаленияОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ПометкаУдаления");
	//	
	//	Если ПометкаУдаленияОснования Тогда 
	//		Возврат;
	//	КонецЕсли;	
	//	
	//	ДокументОбъектОснования		= ДокументОснование.ПолучитьОбъект();
	//	СтрокиПланаПродажОснования	= ДокументОбъектОснования.ПланПродаж.НайтиСтроки(Новый Структура("ДокументРаспределения", Ссылка));
	//	
	//	Для Каждого СтрокаПланаПродажОснования Из СтрокиПланаПродажОснования Цикл 
	//		СтрокаПланаПродаж = ПланПродаж.Найти(СтрокаПланаПродажОснования.ТорговаяТочка, "ТорговаяТочка");
	//		
	//		Если СтрокаПланаПродаж <> Неопределено Тогда 
	//			СтрокаПланаПродажОснования.Статус = Перечисления.ИТ_СтатусыПлановПродаж.Аннулирован;
	//			СтрокаПланаПродажОснования.ДокументРаспределения = Неопределено;	
	//		КонецЕсли;	
	//	КонецЦикла;	
	//	
	//	ДокументЗаписан = Ложь;
	//	ИТ_ЛогированиеСервер.ЗаписатьПровестиДокумент(ДокументОбъектОснования,,,,,,, РежимЗаписиДокумента.Проведение,, ДокументЗаписан);
	//	
	//	Если Не(ДокументЗаписан) Тогда 
	//		Отказ = Истина;
	//		ТекстСообщения = СтрШаблон("Отмена удаления, не удалось внести изменения в документ основания %1", Строка(ДокументОснование)); 
	//		ИТ_ЛогированиеСервер.Ошибка(ТекстСообщения);
	//	КонецЕсли;	
	//КонецЕсли;



	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Ссылка.Статус <> Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании
		И Статус = Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании Тогда 
		
		// СТАРЫЙ МЕХАНИЗМ
		//ДокументОбъектОснования		= ДокументОснование.ПолучитьОбъект();
		//
		//СтрокиПланаПродажОснования	= ДокументОбъектОснования.ПланПродаж.НайтиСтроки(Новый Структура("ДокументРаспределения", Ссылка));
		//
		//Для Каждого СтрокаПланаПродажОснования Из СтрокиПланаПродажОснования Цикл 
		//	СтрокаПланаПродаж = ПланПродаж.Найти(СтрокаПланаПродажОснования.ТорговаяТочка, "ТорговаяТочка");
		//	
		//	Если СтрокаПланаПродаж <> Неопределено Тогда 
		//		СтрокаПланаПродажОснования.Статус = Статус;
		//		ЗаполнитьЗначенияСвойств(СтрокаПланаПродажОснования, СтрокаПланаПродаж);
		//	КонецЕсли;	
		//КонецЦикла;	
		//
		//ИТ_ЛогированиеСервер.ЗаписатьПровестиДокумент(ДокументОбъектОснования,,,,,,, РежимЗаписиДокумента.Проведение);
		
		// НОВЫЙ МЕХАНИЗМ
		//ДокументОбъектОснования = ДокументОснование.ПолучитьОбъект();
		//ДокументОбъектОснования.ОбновитьДанныеПоДочернимДокументам(ПланПродаж.ВыгрузитьКолонку("ТорговаяТочка"));
		//ИТ_ЛогированиеСервер.ЗаписатьПровестиДокумент(ДокументОбъектОснования,,,,,,, РежимЗаписиДокумента.Проведение);
		
		ДатаОтправкиНаСогласование = ТекущаяДата();	
		
		// Отправка уведомлений
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.ЛинейныйМенеджер КАК ЛинейныйМенеджер,
			|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.ПериодПлана КАК ПериодПлана,
			|	""2019-01"" КАК ПериодПлана_Представление,
			|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.ДатаОтправкиНаСогласование КАК ДатаОтправкиНаСогласование,
			|	""31 ЯнваряДекабря 3999 г. 00:00:00"" КАК ДатаОтправкиНаСогласование_Представление
			|ИЗ
			|	Документ.ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер КАК ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер
			|ГДЕ
			|	ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.ПериодПлана = &ПериодПлана
			|	И ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.Проведен
			|	И НЕ ИТ_УстановкаПланаПродаж_ЛинейныйМенеджер.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ПериодПлана", ПериодПлана);
		
		Результат		= Запрос.Выполнить();
		ТаблицаСтатусов	= Результат.Выгрузить();
		
		Для Каждого СтрокаСтатуса Из ТаблицаСтатусов Цикл 
			СтрокаСтатуса.ПериодПлана_Представление = Формат(СтрокаСтатуса.ПериодПлана, "ДФ=гггг-ММ");	
			
			Если ЗначениеЗаполнено(СтрокаСтатуса.ДатаОтправкиНаСогласование) Тогда 
				СтрокаСтатуса.ДатаОтправкиНаСогласование_Представление = Формат(СтрокаСтатуса.ДатаОтправкиНаСогласование, "ДЛФ=DDT");	
			Иначе
				СтрокаСтатуса.ДатаОтправкиНаСогласование_Представление = "Не отправлено";
			КонецЕсли;
		КонецЦикла;	
		
		ТаблицаСтатусов.Колонки.Удалить("ПериодПлана");
		ТаблицаСтатусов.Колонки.Удалить("ДатаОтправкиНаСогласование");
		
		ТаблицаСтатусов.Колонки.Найти("ЛинейныйМенеджер").Заголовок				= "Линейный менеджер";
		ТаблицаСтатусов.Колонки.Найти("ПериодПлана_Представление").Заголовок	= "Период планирования";
		ТаблицаСтатусов.Колонки.Найти("ДатаОтправкиНаСогласование_Представление").Заголовок	= "Отправлено на согласование";
		
		ПараметрыТаблицыЗначений	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыТаблицыЗначенийКакHTML("Статусы по менеджерам"); 
		ТаблицаСтатусовHTML			= ИТ_СпециальныйМодульСервер.ПолучитьТаблицуЗначенийКакHTML(ТаблицаСтатусов, ПараметрыТаблицыЗначений); 
		
		МассивАдресатов	= ИТ_СпециальныйМодульСервер.ПолучитьАдресатовПоФизЛицам(ДокументОснование.СтаршийМенеджер);
		ПараметрыПочты	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПочты();
		ТемаПисьма		= СтрШаблон("План продаж ФММР_%1_%2 на согласовании", Формат(ПериодПлана, "ДФ=гггг-ММ"), Строка(ЛинейныйМенеджер));
		ТелоПисьма		= ИТ_СпециальныйМодульСервер.СформироватьHTML(, ТаблицаСтатусовHTML); 
		АдресОтвета		= ИТ_СпециальныйМодульСервер.ПолучитьАдресСистемнойУчетнойЗаписи();
		ТипПисьма		= Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
		ПараметрыПисьма	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПисьма(МассивАдресатов, ТемаПисьма, ТелоПисьма, АдресОтвета, ТипПисьма, ПараметрыПочты.Профиль);	
		
		ИТ_СпециальныйМодульСервер.ОтправитьПисьмо(ПараметрыПочты, ПараметрыПисьма);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТорговыеТочки(ТорговыеТочки)
	
	Если ТорговыеТочки = Неопределено Тогда 
		ТорговыеТочки = ПланПродаж.ВыгрузитьКолонку("ТорговаяТочка");
	КонецЕсли;
	
	Возврат ТорговыеТочки;
	
КонецФункции	

#КонецОбласти
